---
kind: method
id: M:Autodesk.Revit.DB.ElementArray.ReverseIterator
source: html/f307398e-c7c1-21eb-e155-c5d535e205f2.htm
---
# Autodesk.Revit.DB.ElementArray.ReverseIterator Method

Retrieve a backward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual ElementArrayIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the array.